Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Pickethall.tmx
Source language: ar
Languages: en

source: قل إني على بينة من ربي وكذبتم به ما عندي ما تستعجلون به إن الحكم إلا لله يقص الحق وهو خير الفاصلين
en: Say: I am (relying) on clear proof from my Lord, while ye deny Him. I have not that for which ye are impatient. The decision is for Allah only. He telleth the truth and He is the Best of Deciders.

source: قل لو أن عندي ما تستعجلون به لقضي الأمر بيني وبينكم والله أعلم بالظالمين
en: Say: If I had that for which ye are impatient, then would the case (ere this) have been decided between me and you. Allah is Best Aware of the wrong-doers.

source: وعنده مفاتح الغيب لا يعلمها إلا هو ويعلم ما في البر والبحر وما تسقط من ورقة إلا يعلمها ولا حبة في ظلمات الأرض ولا رطب ولا يابس إلا في كتاب مبين
en: And with Him are the keys of the Invisible. None but He knoweth them. And He knoweth what is in the land and the sea. Not a leaf falleth but He knoweth it, not a grain amid the darkness of the earth, naught of wet or dry but (it is noted) in a clear record.

source: وهو الذي يتوفاكم بالليل ويعلم ما جرحتم بالنهار ثم يبعثكم فيه ليقضى أجل مسمى ثم إليه مرجعكم ثم ينبئكم بما كنتم تعملون
en: He it is Who gathereth you at night and knoweth that which ye commit by day. Then He raiseth you again to life therein, that the term appointed (for you) may be accomplished. And afterward unto Him is your return. Then He will proclaim unto you what ye used to do.

source: وهو القاهر فوق عباده ويرسل عليكم حفظة حتى إذا جاء أحدكم الموت توفته رسلنا وهم لا يفرطون
en: He is the Omnipotent over His slaves. He sendeth guardians over you until, when death cometh unto one of you, Our messengers receive him, and they neglect not.

source: ثم ردوا إلى الله مولاهم الحق ألا له الحكم وهو أسرع الحاسبين
en: Then are they restored unto Allah, their Lord, the Just. Surely His is the judgment. And He is the most swift of reckoners.

source: قل من ينجيكم من ظلمات البر والبحر تدعونه تضرعا وخفية لئن أنجانا من هذه لنكونن من الشاكرين
en: Say: Who delivereth you from the darkness of the land and the sea? Ye call upon Him humbly and in secret, (saying): If we are delivered from this (fear) we truly will be of the thankful.

source: قل الله ينجيكم منها ومن كل كرب ثم أنتم تشركون
en: Say: Allah delivereth you from this and from all affliction. Yet ye attribute partners unto Him.

source: قل هو القادر على أن يبعث عليكم عذابا من فوقكم أو من تحت أرجلكم أو يلبسكم شيعا ويذيق بعضكم بأس بعض انظر كيف نصرف الآيات لعلهم يفقهون
en: Say: He is able to send punishment upon you from above you or from beneath your feet, or to bewilder you with dissension and make you taste the tyranny one of another. See how We display the revelations so that they may understand.

source: وكذب به قومك وهو الحق قل لست عليكم بوكيل
en: Thy people (O Muhammad) have denied it, though it is the Truth. Say: I am not put in charge of you.

source: لكل نبإ مستقر وسوف تعلمون
en: For every announcement there is a term, and ye will come to know.

source: وإذا رأيت الذين يخوضون في آياتنا فأعرض عنهم حتى يخوضوا في حديث غيره وإما ينسينك الشيطان فلا تقعد بعد الذكرى مع القوم الظالمين
en: And when thou seest those who meddle with Our revelations, withdraw from them until they meddle with another topic. And if the devil cause thee to forget, sit not, after the remembrance, with the congregation of wrong-doers.

source: وما على الذين يتقون من حسابهم من شيء ولكن ذكرى لعلهم يتقون
en: Those who ward off (evil) are not accountable for them in aught, but the Reminder (must be given them) that haply they (too) may ward off (evil).

source: وذر الذين اتخذوا دينهم لعبا ولهوا وغرتهم الحياة الدنيا وذكر به أن تبسل نفس بما كسبت ليس لها من دون الله ولي ولا شفيع وإن تعدل كل عدل لا يؤخذ منها أولئك الذين أبسلوا بما كسبوا لهم شراب من حميم وعذاب أليم بما كانوا يكفرون
en: And forsake those who take their religion for a pastime and a jest, and whom the life of the world beguileth. Remind (mankind) hereby lest a soul be destroyed by what it earneth. It hath beside Allah no protecting ally nor intercessor, and though it offer every compensation it will not be accepted from it. Those are they who perish by their own deserts. For them is drink of boiling water and a painful doom, because they disbelieved.

source: قل أندعو من دون الله ما لا ينفعنا ولا يضرنا ونرد على أعقابنا بعد إذ هدانا الله كالذي استهوته الشياطين في الأرض حيران له أصحاب يدعونه إلى الهدى ائتنا قل إن هدى الله هو الهدى وأمرنا لنسلم لرب العالمين
en: Say: Shall we cry, instead of unto Allah, unto that which neither profiteth us nor hurteth us, and shall we turn back after Allah hath guided us, like one bewildered whom the devils have infatuated in the earth, who hath companions who invite him to the guidance (saying): Come unto us? Say: Lo! the guidance of Allah is Guidance, and we are ordered to surrender to the Lord of the Worlds,

source: وأن أقيموا الصلاة واتقوه وهو الذي إليه تحشرون
en: And to establish worship and be dutiful to Him, and He it is unto Whom ye will be gathered.

source: وهو الذي خلق السماوات والأرض بالحق ويوم يقول كن فيكون قوله الحق وله الملك يوم ينفخ في الصور عالم الغيب والشهادة وهو الحكيم الخبير
en: He it is Who created the heavens and the earth in truth. In the day when He saith: Be! it is. His Word is the Truth, and His will be the Sovereignty on the day when the trumpet is blown. Knower of the Invisible and the Visible, He is the Wise, the Aware.

source: وإذ قال إبراهيم لأبيه آزر أتتخذ أصناما آلهة إني أراك وقومك في ضلال مبين
en: (Remember) when Abraham said unto his father Azar: Takest thou idols for gods? Lo! I see thee and thy folk in error manifest.

source: وكذلك نري إبراهيم ملكوت السماوات والأرض وليكون من الموقنين
en: Thus did We show Abraham the kingdom of the heavens and the earth that he might be of those possessing certainty:

source: فلما جن عليه الليل رأى كوكبا قال هذا ربي فلما أفل قال لا أحب الآفلين
en: When the night grew dark upon him he beheld a star. He said: This is my Lord. But when it set, he said: I love not things that set.

source: فلما رأى القمر بازغا قال هذا ربي فلما أفل قال لئن لم يهدني ربي لأكونن من القوم الضالين
en: And when he saw the moon uprising, he exclaimed: This is my Lord. But when it set, he said: Unless my Lord guide me, I surely shall become one of the folk who are astray.

source: فلما رأى الشمس بازغة قال هذا ربي هذا أكبر فلما أفلت قال يا قوم إني بريء مما تشركون
en: And when he saw the sun uprising, he cried: This is my Lord! This is greater! And when it set he exclaimed: O my people! Lo! I am free from all that ye associate (with Him).

source: إني وجهت وجهي للذي فطر السماوات والأرض حنيفا وما أنا من المشركين
en: Lo! I have turned my face toward Him Who created the heavens and the earth, as one by nature upright, and I am not of the idolaters.

source: وحاجه قومه قال أتحاجوني في الله وقد هدان ولا أخاف ما تشركون به إلا أن يشاء ربي شيئا وسع ربي كل شيء علما أفلا تتذكرون
en: His people argued with him. He said: Dispute ye with me concerning Allah when He hath guided me? I fear not at all that which ye set up beside Him unless my Lord willeth aught. My Lord includeth all things in His knowledge. Will ye not then remember?

source: وكيف أخاف ما أشركتم ولا تخافون أنكم أشركتم بالله ما لم ينزل به عليكم سلطانا فأي الفريقين أحق بالأمن إن كنتم تعلمون
en: How should I fear that which ye set up beside Him, when ye fear not to set up beside Allah that for which He hath revealed unto you no warrant? Which of the two factions hath more right to safety? (Answer me that) if ye have knowledge.

source: الذين آمنوا ولم يلبسوا إيمانهم بظلم أولئك لهم الأمن وهم مهتدون
en: Those who believe and obscure not their belief by wrongdoing, theirs is safety; and they are rightly guided.

source: وتلك حجتنا آتيناها إبراهيم على قومه نرفع درجات من نشاء إن ربك حكيم عليم
en: That is Our argument. We gave it unto Abraham against his folk. We raise unto degrees of wisdom whom We will. Lo! thy Lord is Wise, Aware.

source: ووهبنا له إسحاق ويعقوب كلا هدينا ونوحا هدينا من قبل ومن ذريته داوود وسليمان وأيوب ويوسف وموسى وهارون وكذلك نجزي المحسنين
en: And We bestowed upon him Isaac and Jacob; each of them We guided; and Noah did We guide aforetime; and of his seed (We guided) David and Solomon and Job and Joseph and Moses and Aaron. Thus do We reward the good.

source: وزكريا ويحيى وعيسى وإلياس كل من الصالحين
en: And Zachariah and John and Jesus and Elias. Each one (of them) was of the righteous.

source: وإسماعيل واليسع ويونس ولوطا وكلا فضلنا على العالمين
en: And Ishmael and Elisha and Jonah and Lot. Each one (of them) did We prefer above (Our) creatures,

source: ومن آبائهم وذرياتهم وإخوانهم واجتبيناهم وهديناهم إلى صراط مستقيم
en: With some of their forefathers and their offspring and their brethren; and We chose them and guided them unto a straight path.

source: ذلك هدى الله يهدي به من يشاء من عباده ولو أشركوا لحبط عنهم ما كانوا يعملون
en: Such is the guidance of Allah wherewith He guideth whom He will of His bondmen. But if they had set up (for worship) aught beside Him, (all) that they did would have been vain.

source: أولئك الذين آتيناهم الكتاب والحكم والنبوة فإن يكفر بها هؤلاء فقد وكلنا بها قوما ليسوا بها بكافرين
en: Those are they unto whom We gave the Scripture and command and prophethood. But if these disbelieve therein, then indeed We shall entrust it to a people who will not be disbelievers therein.

source: أولئك الذين هدى الله فبهداهم اقتده قل لا أسألكم عليه أجرا إن هو إلا ذكرى للعالمين
en: Those are they whom Allah guideth, so follow their guidance. Say (O Muhammad, unto mankind): I ask of you no fee for it. Lo! it is naught but a Reminder to (His) creatures.

source: وما قدروا الله حق قدره إذ قالوا ما أنزل الله على بشر من شيء قل من أنزل الكتاب الذي جاء به موسى نورا وهدى للناس تجعلونه قراطيس تبدونها وتخفون كثيرا وعلمتم ما لم تعلموا أنتم ولا آباؤكم قل الله ثم ذرهم في خوضهم يلعبون
en: And they measure not the power of Allah its true measure when they say: Allah hath naught revealed unto a human being. Say (unto the Jews who speak thus): Who revealed the Book which Moses brought, a light and guidance for mankind, which ye have put on parchments which ye show, but ye hide much (thereof), and (by which) ye were taught that which ye knew not yourselves nor (did) your fathers (know it)? Say: Allah. Then leave them to their play of cavilling.

source: وهذا كتاب أنزلناه مبارك مصدق الذي بين يديه ولتنذر أم القرى ومن حولها والذين يؤمنون بالآخرة يؤمنون به وهم على صلاتهم يحافظون
en: And this is a blessed Scripture which We have revealed, confirming that which (was revealed) before it, that thou mayst warn the Mother of Villages and those around her. Those who believe in the Hereafter believe herein, and they are careful of their worship.

source: ومن أظلم ممن افترى على الله كذبا أو قال أوحي إلي ولم يوح إليه شيء ومن قال سأنزل مثل ما أنزل الله ولو ترى إذ الظالمون في غمرات الموت والملائكة باسطو أيديهم أخرجوا أنفسكم اليوم تجزون عذاب الهون بما كنتم تقولون على الله غير الحق وكنتم عن آياته تستكبرون
en: Who is guilty of more wrong than he who forgeth a lie against Allah, or saith: I am inspired, when he is not inspired in aught; and who saith: I will reveal the like of that which Allah hath revealed? If thou couldst see, when the wrong-doers reach the pangs of death and the angels stretch their hands out (saying): Deliver up your souls. This day ye are awarded doom of degradation for that ye spake concerning Allah other than the truth, and used to scorn His portents.

source: ولقد جئتمونا فرادى كما خلقناكم أول مرة وتركتم ما خولناكم وراء ظهوركم وما نرى معكم شفعاءكم الذين زعمتم أنهم فيكم شركاء لقد تقطع بينكم وضل عنكم ما كنتم تزعمون
en: Now have ye come unto Us solitary as We did create you at the first, and ye have left behind you all that We bestowed upon you, and We behold not with you those your intercessors, of whom ye claimed that they possessed a share in you. Now is the bond between you severed, and that which ye presumed hath failed you.

source: إن الله فالق الحب والنوى يخرج الحي من الميت ومخرج الميت من الحي ذلكم الله فأنى تؤفكون
en: Lo! Allah (it is) Who splitteth the grain of corn and the date-stone (for sprouting). He bringeth forth the living from the dead, and is the bringer-forth of the dead from the living. Such is Allah. How then are ye perverted?

source: فالق الإصباح وجعل الليل سكنا والشمس والقمر حسبانا ذلك تقدير العزيز العليم
en: He is the Cleaver of the Daybreak, and He hath appointed the night for stillness, and the sun and the moon for reckoning. That is the measuring of the Mighty, the Wise.

source: وهو الذي جعل لكم النجوم لتهتدوا بها في ظلمات البر والبحر قد فصلنا الآيات لقوم يعلمون
en: And He it is Who hath set for you the stars that ye may guide your course by them amid the darkness of the land and the sea. We have detailed Our revelations for a people who have knowledge.

source: وهو الذي أنشأكم من نفس واحدة فمستقر ومستودع قد فصلنا الآيات لقوم يفقهون
en: And He it is Who hath produced you from a single being, and (hath given you) a habitation and a repository. We have detailed Our revelations for a people who have understanding.

source: وهو الذي أنزل من السماء ماء فأخرجنا به نبات كل شيء فأخرجنا منه خضرا نخرج منه حبا متراكبا ومن النخل من طلعها قنوان دانية وجنات من أعناب والزيتون والرمان مشتبها وغير متشابه انظروا إلى ثمره إذا أثمر وينعه إن في ذلكم لآيات لقوم يؤمنون
en: He it is Who sendeth down water from the sky, and therewith We bring forth buds of every kind; We bring forth the green blade from which We bring forth the thick-clustered grain; and from the date-palm, from the pollen thereof, spring pendant bunches; and (We bring forth) gardens of grapes, and the olive and the pomegranate, alike and unlike. Look upon the fruit thereof, when they bear fruit, and upon its ripening. Lo! herein verily are portents for a people who believe.

source: وجعلوا لله شركاء الجن وخلقهم وخرقوا له بنين وبنات بغير علم سبحانه وتعالى عما يصفون
en: Yet they ascribe as partners unto Him the jinn, although He did create them, and impute falsely, without knowledge, sons and daughters unto Him. Glorified be He and High Exalted above (all) that they ascribe (unto Him).

source: بديع السماوات والأرض أنى يكون له ولد ولم تكن له صاحبة وخلق كل شيء وهو بكل شيء عليم
en: The Originator of the heavens and the earth! How can He have a child, when there is for Him no consort, when He created all things and is Aware of all things?

source: ذلكم الله ربكم لا إله إلا هو خالق كل شيء فاعبدوه وهو على كل شيء وكيل
en: Such is Allah, your Lord. There is no Allah save Him, the Creator of all things, so worship Him. And He taketh care of all things.

source: لا تدركه الأبصار وهو يدرك الأبصار وهو اللطيف الخبير
en: Vision comprehendeth Him not, but He comprehendeth (all) vision. He is the Subtile, the Aware.

source: قد جاءكم بصائر من ربكم فمن أبصر فلنفسه ومن عمي فعليها وما أنا عليكم بحفيظ
en: Proofs have come unto you from your Lord, so whoso seeth, it is for his own good, and whoso is blind is blind to his own hurt. And I am not a keeper over you.

source: وكذلك نصرف الآيات وليقولوا درست ولنبينه لقوم يعلمون
en: Thus do We display Our revelations that they may say (unto thee, Muhammad): "Thou hast studied," and that We may make (it) clear for people who have knowledge.

source: اتبع ما أوحي إليك من ربك لا إله إلا هو وأعرض عن المشركين
en: Follow that which is inspired in thee from thy Lord; there is no Allah save Him; and turn away from the idolaters.

source: ولو شاء الله ما أشركوا وما جعلناك عليهم حفيظا وما أنت عليهم بوكيل
en: Had Allah willed, they had not been idolatrous. We have not set thee as a keeper over them, nor art thou responsible for them.

source: ولا تسبوا الذين يدعون من دون الله فيسبوا الله عدوا بغير علم كذلك زينا لكل أمة عملهم ثم إلى ربهم مرجعهم فينبئهم بما كانوا يعملون
en: Revile not those unto whom they pray beside Allah lest they wrongfully revile Allah through ignorance. Thus unto every nation have We made their deed seem fair. Then unto their Lord is their return, and He will tell them what they used to do.

source: وأقسموا بالله جهد أيمانهم لئن جاءتهم آية ليؤمنن بها قل إنما الآيات عند الله وما يشعركم أنها إذا جاءت لا يؤمنون
en: And they swear a solemn oath by Allah that if there come unto them a portent they will believe therein. Say; Portents are with Allah and (so is) that which telleth you that if such came unto them they would not believe.

source: ونقلب أفئدتهم وأبصارهم كما لم يؤمنوا به أول مرة ونذرهم في طغيانهم يعمهون
en: We confound their hearts and their eyes. As they believed not therein at the first, We let them wander blindly on in their contumacy.

source: ولو أننا نزلنا إليهم الملائكة وكلمهم الموتى وحشرنا عليهم كل شيء قبلا ما كانوا ليؤمنوا إلا أن يشاء الله ولكن أكثرهم يجهلون
en: And though We should send down the angels unto them, and the dead should speak unto them, and We should gather against them all things in array, they would not believe unless Allah so willed. Howbeit, most of them are ignorant.

source: وكذلك جعلنا لكل نبي عدوا شياطين الإنس والجن يوحي بعضهم إلى بعض زخرف القول غرورا ولو شاء ربك ما فعلوه فذرهم وما يفترون
en: Thus have We appointed unto every prophet an adversary - devils of humankind and jinn who inspire in one another plausible discourse through guile. If thy Lord willed, they would not do so; so leave them alone with their devising;

source: ولتصغى إليه أفئدة الذين لا يؤمنون بالآخرة وليرضوه وليقترفوا ما هم مقترفون
en: That the hearts of those who believe not in the Hereafter may incline thereto, and that they may take pleasure therein, and that they may earn what they are earning.

source: أفغير الله أبتغي حكما وهو الذي أنزل إليكم الكتاب مفصلا والذين آتيناهم الكتاب يعلمون أنه منزل من ربك بالحق فلا تكونن من الممترين
en: Shall I seek other than Allah for judge, when He it is Who hath revealed unto you (this) Scripture, fully explained? Those unto whom We gave the Scripture (aforetime) know that it is revealed from thy Lord in truth. So be not thou (O Muhammad) of the waverers.

source: وتمت كلمت ربك صدقا وعدلا لا مبدل لكلماته وهو السميع العليم
en: Perfected is the Word of thy Lord in truth and justice. There is naught that can change His words. He is the Hearer, the Knower.

source: وإن تطع أكثر من في الأرض يضلوك عن سبيل الله إن يتبعون إلا الظن وإن هم إلا يخرصون
en: If thou obeyedst most of those on earth they would mislead thee far from Allah's way. They follow naught but an opinion, and they do but guess.

source: إن ربك هو أعلم من يضل عن سبيله وهو أعلم بالمهتدين
en: Lo! thy Lord, He knoweth best who erreth from His way; and He knoweth best (who are) the rightly guided.

source: فكلوا مما ذكر اسم الله عليه إن كنتم بآياته مؤمنين
en: Eat of that over which the name of Allah hath been mentioned, if ye are believers in His revelations.

source: وما لكم ألا تأكلوا مما ذكر اسم الله عليه وقد فصل لكم ما حرم عليكم إلا ما اضطررتم إليه وإن كثيرا ليضلون بأهوائهم بغير علم إن ربك هو أعلم بالمعتدين
en: How should ye not eat of that over which the name of Allah hath been mentioned, when He hath explained unto you that which is forbidden unto you unless ye are compelled thereto. But lo! many are led astray by their own lusts through ignorance. Lo! thy Lord, He is Best Aware of the transgressors.

source: وذروا ظاهر الإثم وباطنه إن الذين يكسبون الإثم سيجزون بما كانوا يقترفون
en: Forsake the outwardness of sin and the inwardness thereof. Lo! those who garner sin will be awarded that which they have earned.

source: ولا تأكلوا مما لم يذكر اسم الله عليه وإنه لفسق وإن الشياطين ليوحون إلى أوليائهم ليجادلوكم وإن أطعتموهم إنكم لمشركون
en: And eat not of that whereon Allah's name hath not been mentioned, for lo! it is abomination. Lo! the devils do inspire their minions to dispute with you. But if ye obey them, ye will be in truth idolaters.

source: أومن كان ميتا فأحييناه وجعلنا له نورا يمشي به في الناس كمن مثله في الظلمات ليس بخارج منها كذلك زين للكافرين ما كانوا يعملون
en: Is he who was dead and We have raised him unto life, and set for him a light wherein he walketh among men, as him whose similitude is in utter darkness whence he cannot emerge? Thus is their conduct made fairseeming for the disbelievers.

source: وكذلك جعلنا في كل قرية أكابر مجرميها ليمكروا فيها وما يمكرون إلا بأنفسهم وما يشعرون
en: And thus have We made in every city great ones of its wicked ones, that they should plot therein. They do but plot against themselves, though they perceive not.

source: وإذا جاءتهم آية قالوا لن نؤمن حتى نؤتى مثل ما أوتي رسل الله الله أعلم حيث يجعل رسالته سيصيب الذين أجرموا صغار عند الله وعذاب شديد بما كانوا يمكرون
en: And when a token cometh unto them, they say: We will not believe till we are given that which Allah's messengers are given. Allah knoweth best with whom to place His message. Humiliation from Allah and heavy punishment will smite the guilty for their scheming.

source: فمن يرد الله أن يهديه يشرح صدره للإسلام ومن يرد أن يضله يجعل صدره ضيقا حرجا كأنما يصعد في السماء كذلك يجعل الله الرجس على الذين لا يؤمنون
en: And whomsoever it is Allah's will to guide, He expandeth his bosom unto the Surrender, and whomsoever it is His Will to send astray, He maketh his bosom close and narrow as if he were engaged in sheer ascent. Thus Allah layeth ignominy upon those who believe not.

source: وهذا صراط ربك مستقيما قد فصلنا الآيات لقوم يذكرون
en: This is the path of thy Lord, a straight path. We have detailed Our revelations for a people who take heed.

source: لهم دار السلام عند ربهم وهو وليهم بما كانوا يعملون
en: For them is the abode of peace with their Lord. He will be their Protecting Friend because of what they used to do.

source: ويوم يحشرهم جميعا يا معشر الجن قد استكثرتم من الإنس وقال أولياؤهم من الإنس ربنا استمتع بعضنا ببعض وبلغنا أجلنا الذي أجلت لنا قال النار مثواكم خالدين فيها إلا ما شاء الله إن ربك حكيم عليم
en: In the day when He will gather them together (He will say): O ye assembly of the jinn! Many of humankind did ye seduce. And their adherents among humankind will say: Our Lord! We enjoyed one another, but now we have arrived at the appointed term which Thou appointedst for us. He will say: Fire is your home. Abide therein for ever, save him whom Allah willeth (to deliver). Lo! thy Lord is Wise, Aware.

source: وكذلك نولي بعض الظالمين بعضا بما كانوا يكسبون
en: Thus We let some of the wrong-doers have power over others because of what they are wont to earn.

source: يا معشر الجن والإنس ألم يأتكم رسل منكم يقصون عليكم آياتي وينذرونكم لقاء يومكم هذا قالوا شهدنا على أنفسنا وغرتهم الحياة الدنيا وشهدوا على أنفسهم أنهم كانوا كافرين
en: O ye assembly of the jinn and humankind! Came there not unto you messengers of your own who recounted unto you My tokens and warned you of the meeting of this your Day? They will say: We testify against ourselves. And the life of the world beguiled them. And they testify against themselves that they were disbelievers.

source: ذلك أن لم يكن ربك مهلك القرى بظلم وأهلها غافلون
en: This is because thy Lord destroyeth not the townships arbitrarily while their people are unconscious (of the wrong they do).

source: ولكل درجات مما عملوا وما ربك بغافل عما يعملون
en: For all there will be ranks from what they did. Thy Lord is not unaware of what they do.

source: وربك الغني ذو الرحمة إن يشأ يذهبكم ويستخلف من بعدكم ما يشاء كما أنشأكم من ذرية قوم آخرين
en: Thy Lord is the Absolute, the Lord of Mercy. If He will, He can remove you and can cause what He will to follow after you, even as He raised you from the seed of other folk.

source: إن ما توعدون لآت وما أنتم بمعجزين
en: Lo! that which ye are promised will surely come to pass, and ye cannot escape.

source: قل يا قوم اعملوا على مكانتكم إني عامل فسوف تعلمون من تكون له عاقبة الدار إنه لا يفلح الظالمون
en: Say (O Muhammad): O my people! Work according to your power. Lo! I too am working. Thus ye will come to know for which of us will be the happy sequel. Lo! the wrong-doers will not be successful.
